# HasValidTypeForReporting Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GlobalParameter..::..HasValidTypeForReporting Method
GlobalParameter Class See Also
---
Tests that the global parameter has data of a type that supports reporting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public bool HasValidTypeForReporting()
```

Visual Basic
---
```text
Public Function HasValidTypeForReporting As Boolean
```

Visual C++
---
```text
public:
bool HasValidTypeForReporting()
```

# ### Return Value
True if the parameter has data of a type that supports reporting; False otherwise.
# Remarks
Only few data types can be used for reporting parmeters. Currently, reporting global parameters must be either of type **Lenght** or **Angle** \- basically, they need to be value-driven by standard dimensions.
# See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace